In [40]:
import pandas as pd
 
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Dates':['05032021','16032021','28032021','28032021']}
 
df1 = pd.DataFrame(data)

df1['Dates'] = pd.to_datetime(df1['Dates'], format='%d%m%Y')

In [41]:
data = {'Name':['Lucas', 'nick', 'krish', 'jack', 'jack', 'jack', 'Erika', 'Joice'],
        'Dates':['05032021','16032021','28032021','28032021', '05032021','16032021', '05032021', '16032021']}
 
df2 = pd.DataFrame(data)

df2['Dates'] = pd.to_datetime(df2['Dates'], format='%d%m%Y')

In [42]:
data = {'Name':['Zack', 'Luiza'],
        'Dates':['05032021','16032021'], 
        }
 
df3 = pd.DataFrame(data)

df3['Dates'] = pd.to_datetime(df3['Dates'], format='%d%m%Y')

In [43]:
data_sets = [df1, df2, df3]

In [51]:
df = pd.DataFrame()

df_0 = data_sets[0] 
len_df_0 = len(list(df_0['Name'].unique()))
mult0 = len_df_0 * 1 
df_total = pd.concat([df, df_0])


df_1 = data_sets[1] 
df_1 = df_1[~df_1['Name'].isin(df_0['Name'].unique())]
len_df_1 = len(list(df_1['Name'].unique()))
mult1 = len_df_1 * 1 
df_total = pd.concat([df_total, df_1])


df_2 = data_sets[2] 
df_2 = df_2[~df_2['Name'].isin(df_total['Name'].unique())]
len_df_2 = len(list(df_2['Name'].unique()))
df_total = pd.concat([df_total, df_2])

In [52]:
mult1

3

In [46]:
df_2

    Name      Dates
0   Zack 2021-03-05
1  Luiza 2021-03-16

In [47]:
df_total

    Name      Dates
0    Tom 2021-03-05
1   nick 2021-03-16
2  krish 2021-03-28
3   jack 2021-03-28
0  Lucas 2021-03-05
6  Erika 2021-03-05
7  Joice 2021-03-16
0   Zack 2021-03-05
1  Luiza 2021-03-16

In [90]:
tamanho = 5
tamanho_dfs = len(list(set (list(df2['Name'].unique()) + list(df['Name'].unique()))))
d1_tam = 0.4 * 5
d2_tam = 0.6 * 5

In [91]:
if len(list(df['Name'].unique())) < d1_tam:
    df_final = df
else:
    interator = 1
    it = 0
    while it <  d1_tam  :
        interator = interator +1 
        df_iterator = df[:interator]
        it = len(list(df_iterator['Name'].unique()))
        print( df_iterator)

   Name      Dates
0   Tom 2021-03-05
1  nick 2021-03-16

In [92]:
df2 = df2[~df2['Name'].isin( df_iterator['Name'].unique())]

In [93]:
df_iterator['Name'].unique()

array(['Tom', 'nick'], dtype=object)

In [94]:
df2

    Name      Dates
0  Lucas 2021-03-05
2  krish 2021-03-28
3   jack 2021-03-28
4   jack 2021-03-05
5   jack 2021-03-16
6  Erika 2021-03-05
7  Joice 2021-03-16

In [95]:
if len(list(df2['Name'].unique())) < d2_tam:
    df_final = df2
else:
    interator = 1
    it = 0
    while it <  d2_tam  :
        interator = interator +1 
        df_iterator = df2[:interator]
        it = len(list(df_iterator['Name'].unique()))
        print( df_iterator)

    Name      Dates
0  Lucas 2021-03-05
2  krish 2021-03-28
    Name      Dates
0  Lucas 2021-03-05
2  krish 2021-03-28
3   jack 2021-03-28

In [96]:
df[:len(df['Name'])]

    Name      Dates
0    Tom 2021-03-05
1   nick 2021-03-16
2  krish 2021-03-28
3   jack 2021-03-28

In [97]:
d2_tam

3.0

In [98]:
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Lucas', 'nick', 'krish', 'jack', 'jack', 'jack', 'Erika', 'Joice'],
        'Dates':['05032021','16032021','28032021','28032021', '05032021','16032021', '05032021', '16032021'],
        'Compra':[ 5, 10 , 21 , 6 , 7 , 1 , 11 , 10]       
        }
 
df3 = pd.DataFrame(data)

df3['Dates'] = pd.to_datetime(df3['Dates'], format='%d%m%Y')

In [99]:
df3 = df3[~df3['Name'].isin( df_iterator['Name'].unique())]

In [100]:
df3 = df3.sort_values('Compra')

In [101]:
df3

    Name      Dates  Compra
1   nick 2021-03-16      10
7  Joice 2021-03-16      10
6  Erika 2021-03-05      11

In [102]:
d3_tam = 4

In [103]:
if len(list(df3['Name'].unique())) < d3_tam:
    df_final = df3
else:
    interator = 1
    it = 0
    while it <  d3_tam  :
        interator = interator +1 
        df_iterator = df3[:interator]
        it = len(list(df_iterator['Name'].unique()))
        print( df_iterator)

In [105]:
df_final

    Name      Dates  Compra
1   nick 2021-03-16      10
7  Joice 2021-03-16      10
6  Erika 2021-03-05      11

In [106]:
import pandas as pd
 
# intialise data of lists.
data = {'Name':['Lucas', 'nick', 'krish', 'jack', 'jack', 'jack', 'Erika', 'Joice'],
        'Dates':['05032021','16032021','28032021','28032021', '05032021','16032021', '05032021', '16032021'],
        'Compra':[ 5, 10 , 21 , 6 , 7 , 1 , 11 , 10]       
        }
 
df3 = pd.DataFrame(data)

df3['Dates'] = pd.to_datetime(df3['Dates'], format='%d%m%Y')

df3 = df3.sort_values('Compra')

if len(list(df3['Name'].unique())) < d3_tam:
    df_final = df3
else:
    interator = 1
    it = 0
    while it <  d3_tam  :
        interator = interator +1 
        df_iterator = df3[:interator]
        it = len(list(df_iterator['Name'].unique()))
        print( df_iterator)

    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
3   jack 2021-03-28       6
    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
3   jack 2021-03-28       6
4   jack 2021-03-05       7
    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
3   jack 2021-03-28       6
4   jack 2021-03-05       7
1   nick 2021-03-16      10
    Name      Dates  Compra
5   jack 2021-03-16       1
0  Lucas 2021-03-05       5
3   jack 2021-03-28       6
4   jack 2021-03-05       7
1   nick 2021-03-16      10
7  Joice 2021-03-16      10

In [ ]:
dfs =[]